{
    "138": {
        "id": 138,
        "title": "Encerramento Official",
        "description": "Encerramento Official",
        "image": "/images/backgrounds/closing.jpg",
        "tags": [
            "general"
        ]
    },
    "136": {
        "id": 136,
        "title": "Abertura DevFestBH",
        "description": "Official start of the conference. Greetings from the organizers, sponsors and partners.",
        "image": "/images/backgrounds/opening.jpg",
        "tags": [
            "general"
        ]
    },
    "134": {
        "id": 134,
        "title": "Coffee break",
        "description": "Coffeeeeeee!",
        "image": "/images/backgrounds/coffee-break.jpg",
        "tags": [
            "general"
        ]
    },
    "133": {
        "id": 133,
        "title": "Almoço",
        "description": "Vaaamooos Cooomeeeer!",
        "image": "/images/backgrounds/lunch.jpg",
        "tags": [
            "general"
        ]
    },
    "132": {
        "id": 132,
        "title": "Credenciamento e coffee-break",
        "description": "Hora de se registrar e também aquecer os motores para a grande festa",
        "image": "/images/backgrounds/registration.jpg",
        "tags": [
            "general"
        ]
    },
    "131": {
        "id": 131,
        "title": "Anti-patterns & premature optimization",
        "description": "Quem nunca pensou na performance daquele microservice antes mesmo de pensar em sua arquitetura, que atire a primeira pedra! Nessa palestra discutiremos os mals hábitos de se pensar em otimização de forma prematura, e descobriremos que software que aumentar receita > software que reduz custos.",
        "speakers": [
            15
        ],
        "tags": [
            "Libraries"
        ]
    },
    "130": {
        "id": 130,
        "title": "AMA - Converse com os Artistas",
        "description": "Momento onde você poderá interagir com os palestrantes, tirar dúvidas e fazer networking",
        "speakers": [
            
        ],
        "tags": [
        ]
    },
    "129": {
        "id": 129,
        "title": "AMA - Converse com os Artistas",
        "description": "Momento onde você poderá interagir com os palestrantes, tirar dúvidas e fazer networking",
        "speakers": [

        ],
        "tags": [
        ]
    },
    "128": {
        "id": 128,
        "title": "CEO de startup!? Oi?",
        "description": "Priscila Gama, mulher, negra, não entendedora (ainda) de programação, fala um pouco sobre como o fato de ser exatamente quem é, a levou a co-fundar a Malalai, startup de segurança pessoal feminina. Ela irá compartilhar o que aprendeu até aqui sobre esta recém descoberta.",
        "speakers": [
            18
        ],
        "tags": [
            "Empreendedorismo"
        ]
    },
    "127": {
        "id": 127,
        "title": "Metodologias ágeis",
        "description": "Vamos falar um pouco sobre Metodologias Ágeis? Entender onde vivem, o que comem e como se reproduzem os times ágeis. No fim de tudo eu garanto que seremos conhecedores das manhas e dos paranauês das metodologias ágeis e saber como atuar em um time ágil sem passar vergonha!",
        "speakers": [
            16
        ],
        "tags": [
            "Libraries"
        ]
    },
    "126": {
        "id": 126,
        "title": "Metodologias CSS",
        "description": "Já pegou códigos CSS imensos e com várias regras repetidas? Pois então, há maneiras de produzir seu CSS de maneira eficiente e eu falarei um pouco sobre as metodologias CSS e seus aliados para melhorar a performance no seu código CSS.",
        "speakers": [
            17
        ],
        "tags": [
            "Libraries"
        ]
    },
    "125": {
        "id": 125,
        "title": "Aplicações mobile escaláveis - Escolha a arquitetura certa para sua aplicação Android",
        "description": "Nessa talk iremos discutir como construir grades aplicações Android de uma forma escalável e testável. Discutindo e comparando o padrão arquitetural nativo de aplicações android com novos padrões como MVP e MVVM.",
        "speakers": [
            14
        ],
        "tags": [
            "Android"
        ]
    },
    "119": {
        "id": 119,
        "title": "Remote Work: Less Stress, More Productivity",
        "description": "Nesta palestra é apresentado o modelo de trabalho remoto e os modos que o mesmo é geralmente aplicado pelas empresas e também coloca em evidência riscos, preocupações, benefícios e responsabilidades que o profissional deve dar importância ao aderir este tipo de relacionamento com o empregador.",
        "speakers": [
            13
        ],
        "tags": [
            "Empreendedorismo"
        ]
    },
    "118": {
        "id": 118,
        "title": "Nativo x Híbrido - Tira sua própria conclusão",
        "description": "Atualmente existe várias formas de se construir um projeto mobile e a decisão mais importante é qual começar. Quais são? Quais vantagens e desvantagens de cada escolha? Como você define qual utilizar?  Uma comparação entre Híbrido/Nativo e quais os principais pontos você tem que considerar para poder fazer essa escolha.",
        "speakers": [
          12
        ],
        "tags": [
            "Android"
        ]
    },
    "113": {
        "id": 113,
        "title": "Hotmart - A DEFINIR",
        "description": "A DEFINIR",
        "speakers": [
            22
        ],
        "tags": [
            "Empreendedorismo"
        ]
    },
    "112": {
        "id": 112,
        "title": "Empreendedorismo Digital: oportunidade, conexão e negócios.",
        "description": "O empreendedorismo digital tem ganhado cada vez mais espaço na atualidade. Mas quais são as características desse novo empreendedor, quais são as metodologias utilizadas por esses novos negócios e como eles podem impactar a vida das pessoas e quais oportunidades existem nesse ecossistema de empreendedorismo. Essas são algumas perguntas que serão respondidas na palestra sobre o empreendedorismo digital.",
        "speakers": [
            9
        ],
        "tags": [
            "Empreendedorismo"
        ]
    },
    "111": {
        "id": 111,
        "title": "Desenvolvendo para Android Wear usando Firebase",
        "description": "Seu app já esta no Android Wear? Não, então descubra como levar seu app para o Android Wear tambem e como usar o firebase para tirar melhor proveito das duas plataformas.",
        "speakers": [
            8
        ],
        "tags": [
            "Android Wear",
            "Firebase"
        ]
    },
    "110": {
        "id": 110,
        "title": "Pesquisa de Guerrilha: Entendendo seu usuário com agilidade e baixo custo.",
        "description": "Pesquisa te dá direção ao invés de adivinhação, e dados ao invés de opinião ou especulação. E você sabia que pode ser mais rápido e barato do que o que você imagina? Vamos abordar algumas estratégias e cases para pesquisas com baixo custo, as Pesquisas de Guerrilha.",
        "speakers": [
            2
        ],
        "tags": [
            "UX"
        ]
    },
    "109": {
        "id": 109,
        "title": "Firebase: Dando um Up na sua aplicação",
        "description": "Ei developer! Você está cansado de usar diferentes ferramentas para engajar seus usuários, gerar dados para analytics, enviar notificações e elas não são integradas. Então venha conhecer o Firebase e aprender como da um up nas suas aplicações.",
        "speakers": [
            7
        ],
        "tags": [
            "Android",
            "Firebase"
        ]
    },
    "108": {
        "id": 108,
        "title": "Comunidades: porque participar?",
        "description": "Vamos bater um papo sobre o MinasDev e como comunidades de desenvolvedores impactam o cenário de TI em Belo Horizonte.",
        "speakers": [
            10,
            11
        ],
        "language": "Portuguese",
        "tags": [
            "Comunidade"
        ]
    },
    "107": {
        "id": 107,
        "title": "Começando com Machine Learning usando Produtos Google",
        "description": "Um walkthrough de como utilizar produtos Google, como a Cloud Vision API e o TensorFlow, pra desenvolver Machine Learning based software.",
        "speakers": [
            6
        ],
        "tags": [
            "Machine Learning"
        ]
    },
    "106": {
        "id": 106,
        "title": "Internet dos Trem e como não colocar fogo em casa",
        "description": "Mineirices a parte, internet das coisas, além de ser a buzzword mais conhecida depois de Ajax, traz uma série de considerações, principalmente da comunidade maker. Será possível, através dela coletar dados, prever e até mesmo automatizar e montar a interação do homem com a máquina, criando novas interfaces e detectando automaticamente situações baseadas no comportamento humano irão moldar as próximas tecnologias. Por isso, vamos fazer uma abordagem prática de uma das tecnologias relacionadas a assistentes pessoais como o Amazon Echo (e especular sobre o futuro lançamento do Google Home), para criarmos um dispositivo que possa ser controlado por ele utilizando hacks que já existem. Ah, e como não colocar fogo em casa? Nesse tópico, abordaremos o que você pode fazer utilizando alguns devices que já existem e criando novos que integrem com equipamentos antigos e como deixá-los conectados através da web utilizando Firebase.",
        "speakers": [
            5
        ],
        "tags": [
            "Iot",
            "Firebase"
        ]
    },
    "105": {
        "id": 105,
        "title": "Diversidade em TI",
        "description": "Analisando estruturalmente os motivos que levam à falta de diversidade na área de TI, observando a minha própria história como mulher transexual, faço um panorama dos diversos motores sociais que levam à exclusão e expulsão das minorias oprimidas dentro do setor, focando-se especificamente dentro do meu contexto e observação.",
        "speakers": [
            4
        ],
        "tags": [
            "WTM",
            "Comunidade"
        ]
    },
    "104": {
        "id": 104,
        "title": "PWAs: Fazendo mágica com Service Workers.",
        "description": "Tornaremos a sua página ou aplicação web em algo que, com JavaScript, irá oferecer suporte a redirects, páginas 404, tratamento para imagens com problemas e vai...funcionar offline! Como num passe de mágica, faremos a tua aplicação web ser instalada, funcionar offline e em internet intermitente.",
        "speakers": [
            3
        ],
        "tags": [
            "Web",
            "Progressive Web Apps",
            "JS"
        ]
    },
    "101": {
        "id": 101,
        "title": "Aplicativos Híbridos com Ionic 2",
        "description": "Ionic 2 é um framework open source para desenvolvimento de aplicativos mobile híbrido, onde se pode desenvolver o aplicativo usando HTML/CSS e JavaScript, fazer acesso nativo usando essas tecnologias e compilar o app para diferentes plataformas como iOS, Android e Windows Phone e publicá-lo nas respectivas app stores. O Ionic 2 é baseado em frameworks também open source e populares no mercado: Phonegap/Cordova, Angular2 e Sass (CSS). Vamos aprender como criar tipos de apps populares nas lojas usando conceitos do Angular 2 (Components, Templates, Pipes, Diretivas, Serviços + RxJS Observables) integrando-os com o CSS e componentes visuais do Ionic.",
        "speakers": [
            1
        ],
        "tags": [
            "Ionic",
            "Angular JS"
        ]
    }
}
